Repository: Ajai7888/jalnetra
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appName
source: JALNETRA
hi: जलनेत्र
ta: ஜல்நேத்ரா

# tagline
source: Smart River Water Level Monitoring
hi: स्मार्ट नदी जल स्तर निगरानी
ta: ச마트 நதி நீர்மட்ட கண்காணிப்பு

source: Select Language
hi: भाषा चुनें
ta: மொழியைத் தேர்ந்தெடுக்கவும்

# roleSelectionTitle
source: Select Your Role to Login
hi: लॉगिन के लिए अपनी भूमिका चुनें
ta: உள்நுழைய உங்கள் பங்கைத் தேர்ந்தெடுக்கவும்

source: PROCEED TO LOGIN
hi: लॉगिन जारी रखें
ta: உள்நுழைய தொடரவும்

source: Field Officer Login
hi: फील्ड अधिकारी लॉगिन
ta: புலம் அதிகாரி உள்நுழைவு

source: Supervisor Login
hi: पर्यवेक्षक लॉगिन
ta: மேற்பார்வையாளரின் உள்நுழைவு

source: Analyst Login
hi: विश्लेषक लॉगिन
ta: பகுப்பாய்வாளர் உள்நுழைவு

# adminLogin
source: Administrator Login
hi: प्रशासक लॉगिन
ta: நிர்வாகி உள்நுழைவு

source: Email or User ID
hi: ईमेल या यूज़र आईडी
ta: மின்னஞ்சல் அல்லது பயனர் ஐடி

source: Password
hi: पासवर्ड
ta: கடவுச்சொல்

source: Login
hi: लॉगिन
ta: உள்நுழைக

# signupQuestion
source: Don't have an account? Sign Up
hi: खाता नहीं है? साइन अप करें
ta: கணக்கு இல்லையா? பதிவு செய்யவும்

source: Login Failed
hi: लॉगिन असफल
ta: உள்நுழைவு தோல்வி

# invalidCredentials
source: Invalid credentials or user not found. Please try again.
hi: अमान्य जानकारी। कृपया फिर से प्रयास करें।
ta: தவறான விவரங்கள். மீண்டும் முயற்சிக்கவும்.

source: Role Mismatch
hi: भूमिका मेल नहीं खाती
ta: பங்கு பொருந்தவில்லை

# roleMismatchMsg
source: The logged-in user's role does not match the selected role.
hi: लॉगिन की गई भूमिका चयनित भूमिका से मेल नहीं खाती।
ta: உள்நுழைந்த பயனரின் பங்கு தேர்ந்தெடுத்த பங்குடன் பொருந்தவில்லை.

source: Okay
hi: ठीक है
ta: சரி

source: Field Officer Registration
hi: फील्ड अधिकारी पंजीकरण
ta: புலம் அதிகாரி பதிவு

source: Supervisor Registration
hi: पर्यवेक्षक पंजीकरण
ta: மேற்பார்வையாளர் பதிவு

source: Analyst Registration
hi: विश्लेषक पंजीकरण
ta: பகுப்பாய்வாளர் பதிவு

# adminRegistration
source: Administrator Registration
hi: प्रशासक पंजीकरण
ta: நிர்வாகி பதிவு

# registrationDetails
source: Registration Details for {role} Role
hi: {role} भूमिका के लिए पंजीकरण विवरण
ta: {role} பங்கு பதிவு விவரங்கள்

source: Full Name
hi: पूरा नाम
ta: முழு பெயர்

source: Official Email
hi: आधिकारिक ईमेल
ta: அதிகாரப்பூர்வ மின்னஞ்சல்

# passwordMin
source: Password (min 6 chars)
hi: पासवर्ड (कम से कम 6 अक्षर)
ta: கடவுச்சொல் (குறைந்தது 6 எழுத்துகள்)

source: Employee ID
hi: कर्मचारी आईडी
ta: பணியாளர் ஐடி

source: Phone Number
hi: फ़ोन नंबर
ta: தொலைபேசி எண்

source: Department
hi: विभाग
ta: துறை

source: Designation
hi: पदनाम
ta: பதவி

# adminCode
source: Admin Authorization Code
hi: एडमिन प्रमाणीकरण कोड
ta: நிர்வாக அங்கீகார குறியீடு

source: Register Account
hi: खाता पंजीकृत करें
ta: கணக்கை பதிவு செய்யவும்

# backToLogin
source: Already have an account? Back to Login
hi: पहले से खाता है? लॉगिन पर वापस जाएं
ta: ஏற்கனவே கணக்கு உள்ளதா? உள்நுழைய திரும்பவும்

source: Registration Successful
hi: पंजीकरण सफल
ta: பதிவு வெற்றிகரமாக நிறைவு

# accountCreatedMsg
source: Your account for the {role} role has been created. Please log in.
hi: {role} भूमिका के लिए आपका खाता बन गया है। कृपया लॉगिन करें।
ta: {role} பங்கு கணக்கு உருவாக்கப்பட்டுள்ளது. தயவுசெய்து உள்நுழைக.

source: Registration Failed
hi: पंजीकरण असफल
ta: பதிவு தோல்வி

# emailInUse
source: This email is already registered. Please use the Login screen.
hi: यह ईमेल पहले से पंजीकृत है।
ta: இந்த மின்னஞ்சல் ஏற்கனவே பதிவு செய்யப்பட்டுள்ளது.

# weakPassword
source: The password is too weak. Choose a stronger one.
hi: पासवर्ड बहुत कमजोर है।
ta: கடவுச்சொல் பலவீனமாக உள்ளது.

# unexpectedError
source: An unexpected error occurred. Please try again.
hi: कुछ त्रुटि हुई। कृपया पुनः प्रयास करें।
ta: எதிர்பாராத பிழை. மீண்டும் முயற்சிக்கவும்.

source: Authorization Failed
hi: प्रमाणीकरण असफल
ta: அங்கீகாரம் தோல்வி

# invalidAdminCode
source: Invalid Admin Code. Registration requires a valid authorization key.
hi: अमान्य एडमिन कोड — पंजीकरण के लिए वैध कोड आवश्यक।
ta: தவறான நிர்வாக குறியீடு — செல்லுபடியாகும் குறியீடு தேவை.

# dashboardTitleOfficer
source: Field Personnel Dashboard
hi: फील्ड कर्मचारी डैशबोर्ड
ta: புலம் பணியாளர் கட்டுப்பாடு

# dashboardTitleAnalyst
source: JALNETRA - Analytics
hi: जलनेत्र - विश्लेषण
ta: ஜல்நேத்ரா - பகுப்பாய்வு

# dashboardTitleAdmin
source: Admin Dashboard
hi: एडमिन डैशबोर्ड
ta: நிர்வாக கட்டுப்பாடு

source: Check Weather
hi: मौसम देखें
ta: வானிலை பார்க்க

source: View Profile
hi: प्रोफ़ाइल देखें
ta: சுயவிவரம் பார்க்க

source: Logout
hi: लॉगआउट
ta: வெளியேறு

# locationUnavailable
source: Location Unavailable. Check GPS/Permissions.
hi: स्थान उपलब्ध नहीं — GPS/अनुमतियाँ जाँचें।
ta: இடம் கிடைக்கவில்லை — GPS/அனுமதிகளைச் சரிபார்க்கவும்.

source: Profile
hi: प्रोफ़ाइल
ta: சுயவிவரம்

source: User not logged in.
hi: यूज़र लॉगिन नहीं है।
ta: பயனர் உள்நுழைக்கப்படவில்லை.

# profileFetchError
source: Error fetching user data:
hi: प्रोफ़ाइल लोड करने में त्रुटि:
ta: பயனர் தரவை பெறுவதில் பிழை:

source: User Profile
hi: यूज़र प्रोफ़ाइल
ta: பயனர் சுயவிவரம்

source: Email
hi: ईमेल
ta: மின்னஞ்சல்

source: Phone
hi: फ़ोन
ta: தொலைபேசி

source: Edit Profile
hi: प्रोफ़ाइल संपादित करें
ta: சுயவிவரம் திருத்து

# editFeaturePending
source: Profile edit feature coming soon.
hi: प्रोफ़ाइल संपादन सुविधा जल्द आ रही है।
ta: சுயவிவரம் திருத்தும் அம்சம் விரைவில் வருகிறது.

# fetchingWeather
source: Fetching live weather data...
hi: लाइव मौसम डेटा प्राप्त किया जा रहा है...
ta: நேரடி வானிலை தரவு பெறப்படுகிறது...

# mapPlaceholder
source: Live Geo-Tracking Placeholder
hi: लाइव जियो ट्रैकिंग
ta: நேரடி புவி-கண்காணிப்பு

# mapPlaceholderSub
source: Showing current location and geofence for readings.
hi: वर्तमान लोकेशन और जियोज़ोन प्रदर्शित किया जा रहा है।
ta: நேரடி இடம் மற்றும் தள ஜியோ-வேலி.

source: Capture Reading
hi: पठन रिकॉर्ड करें
ta: நிர்ணயத்தை பதிவு செய்

source: Step
hi: चरण
ta: படி

source: Get Live Location
hi: लाइव स्थान प्राप्त करें
ta: நேரடி இருப்பிடத்தை பெற

source: GPS Found
hi: GPS मिला
ta: GPS கிடைக்கிறது

# awaitingGps
source: Awaiting GPS Fix...
hi: GPS सिग्नल की प्रतीक्षा...
ta: GPS தேடப்படுகிறது...

source: Proceed to QR Scan
hi: QR स्कैन पर जारी रखें
ta: QR ஸ்கேனுக்கு செல்லவும்

source: Retry GPS
hi: GPS पुनः प्रयास
ta: GPS மீண்டும் முயற்சி

# scanQrCode
source: Scan Site QR Code
hi: साइट QR कोड स्कैन करें
ta: தள QR குறியீட்டை ஸ்கேன் செய்

# scanInstruction
source: Scan the physical QR label on the gauge post.
hi: गेज पोल पर लगे QR लेबल को स्कैन करें।
ta: கேஜ் தூணில் உள்ள QR லேபிளை ஸ்கேன் செய்க.

source: Start QR Scanner
hi: QR स्कैनर प्रारंभ करें
ta: QR ஸ்கேனர் ஆரம்பி

source: Validating position...
hi: स्थान सत्यापित किया जा रहा है...
ta: இடம் சரிபார்க்கப்படுகிறது...

source: Geofence Passed
hi: जियोफेंस सफल
ta: புவி-வேலி சரி

source: Geofence Failed
hi: जियोफेंस असफल
ta: புவி-வேலி தோல்வி

source: Distance to Site
hi: साइट तक की दूरी
ta: தளத்திற்கான தூரம்

source: Proceed to Capture
hi: कैप्चर करने के लिए आगे बढ़ें
ta: படம் பிடிக்க தொடரவும்

# backAndRetry
source: Back & Retry
hi: वापस जाएं और पुनः प्रयास करें
ta: திரும்பி மீண்டும் முயற்சி

source: Launching Camera
hi: कैमरा चालू किया जा रहा है
ta: கேமரா திறக்கப்படுகிறது

# prepareCamera
source: Launching Camera for Gauge Capture...
hi: गेज कैप्चर के लिए कैमरा तैयार किया जा रहा है...
ta: கேஜ் படமெடுப்பதற்கான கேமரா தயாராகிறது...

source: Log Reading
hi: पठन दर्ज करें
ta: தரவை பதிவு செய்

# imagePreview
source: Captured Image Preview
hi: क्लिक की गई छवि पूर्वावलोकन
ta: பிடிக்கப்பட்ட பட முன்னோட்டம்

source: Water Level
hi: जल स्तर
ta: நீர்மட்டம்

# levelRequired
source: Water level is required
hi: जल स्तर आवश्यक है
ta: நீர்மட்டத்தை உள்ளிட வேண்டும்

# submitAndEncrypt
source: Submit Reading & Encrypt
hi: सबमिट करें और एन्क्रिप्ट करें
ta: பதிவை சமர்ப்பித்து குறியாக்கு

# readingSubmitted
source: Reading submitted successfully!
hi: पठन सफलतापूर्वक जमा किया गया!
ta: பதிவு வெற்றிகரமாக சேர்க்கப்பட்டது!

# submissionFailed
source: Submission failed. Error:
hi: सबमिट असफल — त्रुटि:
ta: பதிவு தோல்வி. பிழை:

source: Missing data.
hi: डेटा अनुपलब्ध है।
ta: தரவு குறைவாக உள்ளது.

# photoCancelled
source: Photo capture cancelled. Please retry.
hi: फोटो रद्द किया गया — पुनः प्रयास करें।
ta: படம் எடுப்பு ரத்து — மீண்டும் முயற்சிக்கவும்.

# qrCancelled
source: QR scanning cancelled. Returning to GPS.
hi: QR स्कैन रद्द — GPS पर लौट रहा है।
ta: QR ஸ்கேன் ரத்து — GPS-க்கு திரும்புகிறது.

source: QR processing failed.
hi: QR प्रक्रिया विफल।
ta: QR செயலாக்கம் தோல்வி.

# gpsError
source: Location check failed. Enable GPS & retry.
hi: GPS त्रुटि — अनुमति सक्षम कर पुनः प्रयास करें।
ta: GPS பிழை — அனுமதி இயக்கி மீண்டும் முயற்சிக்கவும்.

# speechNotAvailable
source: Speech recognition not available.
hi: वॉइस रिकग्निशन उपलब्ध नहीं।
ta: குரல் அங்கீகாரம் கிடைக்கவில்லை.

# voiceLevelDetected
source: Level set via voice:
hi: वॉइस द्वारा स्तर दर्ज:
ta: குரல் மூலம் அளவு உள்ளிடப்பட்டது:

# voiceInvalidInput
source: Voice input not recognized.
hi: वॉइस इनपुट पहचाना नहीं गया।
ta: குரல் உள்ளீடு அடையாளம் காணப்படவில்லை.

# speechRecognizing
source: Recognizing
hi: पहचाना जा रहा है...
ta: அடையாளம் காணப்படுகிறது...

source: QR Scanner
hi: QR स्कैनर
ta: QR ஸ்கேனர்

# cameraPermissionRequired
source: Camera permission is required to scan the site QR code.
hi: QR स्कैन करने के लिए कैमरा अनुमति आवश्यक है।
ta: QR ஸ்கேனுக்கு கேமரா அனுமதி தேவை.

source: Retry Permission
hi: अनुमति पुनः प्रयास
ta: அனுமதி மீண்டும் முயற்சி

# openSettings
source: Open App Settings
hi: ऐप सेटिंग्स खोलें
ta: அமைப்புகளை திறக்க

# cameraDenied
source: Camera permission denied. Cannot scan QR.
hi: कैमरा अनुमति अस्वीकृत।
ta: கேமரா அனுமதி மறுக்கப்பட்டது.

# cameraPermanentlyDenied
source: Camera permission permanently denied. Enable it in Settings.
hi: अनुमति स्थायी रूप से अस्वीकृत — सेटिंग्स में सक्षम करें।
ta: அனுமதி நிரந்தரமாக மறுக்கப்பட்டது — அமைப்புகளில் இயக்கு.

# currentSiteLabel
source: Current Site
hi: वर्तमान साइट
ta: தற்போதைய தளம்

# publicUserLogin
source: People Login
hi: जनता लॉगिन
ta: மக்கள் உள்நுழைவு

# publicUserRegistration
source: People Registration
hi: जनता पंजीकरण
ta: மக்கள் பதிவு

# publicUserDashboard
source: People Dashboard
hi: जनता डैशबोर्ड
ta: மக்கள் கட்டுப்பாடு

# sosAlert
source: Send SOS Alert
hi: SOS अलर्ट भेजें
ta: SOS எச்சரிக்கை அனுப்பு

# sosMessagePrompt
source: Describe your emergency situation briefly.
hi: अपनी आपात स्थिति का संक्षिप्त विवरण दें।
ta: உங்கள் அவசர நிலையைச் சுருக்கமாக விளக்கவும்.

# yourEmail
source: Your registered email
hi: आपका पंजीकृत ईमेल
ta: உங்கள் பதிவு மின்னஞ்சல்

# sendSos
source: Send Alert
hi: अलर्ट भेजें
ta: எச்சரிக்கை அனுப்பு

source: Cancel
hi: रद्द
ta: ரத்து

# sosSentSuccess
source: ðŸš¨ SOS alert sent successfully! Help is on the way.
hi: 🚨 SOS अलर्ट सफलतापूर्वक भेजा गया! सहायता रास्ते में है।
ta: 🚨 SOS அனுப்பப்பட்டது! உதவி வருகிறது.

# sosSentFailure
source: SOS alert failed to send. Check your connection.
hi: SOS भेजने में विफल — इंटरनेट जांचें।
ta: SOS அனுப்புதல் தோல்வி — இணையத்தைச் சரிபார்க்கவும்.

# sosDefaultMessage
source: Emergency detected. Requester needs assistance.
hi: आपात स्थिति का पता चला — सहायता चाहिए।
ta: அவசர நிலை கண்டறியப்பட்டது — உதவி தேவை.

source: Message
hi: संदेश
ta: செய்தி

# loginRequiredForSos
source: You must be logged in to send an SOS alert.
hi: SOS अलर्ट भेजने के लिए आपको लॉग इन होना आवश्यक है।
ta: SOS எச்சரிக்கையை அனுப்ப நீங்கள் உள்நுழைந்திருக்க வேண்டும்.

source: Not Logged In
hi: लॉग इन नहीं किया गया
ta: உள்நுழையவில்லை

# dlSuccess
source: DL Model Success: Auto reading generated.
hi: DL मॉडल सफल: स्वतः रीडिंग उत्पन्न की गई।
ta: DL மாடல் வெற்றி: தானியங்கி வாசிப்பு உருவாக்கப்பட்டது.

# dlFailed
source: DL Model Failed: Could not parse image result.
hi: DL मॉडल असफल: छवि परिणाम को पढ़ा नहीं जा सका।
ta: ⚠DL மாடல் தோல்வி: படத்தின் முடிவை அணுக முடியவில்லை.

# dlApiError
source: DL API Error: Status Code
hi: DL API त्रुटि: स्टेटस कोड
ta: DL API பிழை: நிலை குறியீடு

# dlProcessingError
source: DL Processing Exception: Check connection.
hi: DL प्रोसेसिंग त्रुटि: कनेक्शन जांचें।
ta: DL செயலாக்க பிழை: இணைப்பை சரிபார்க்கவும்.

# autoWaterLevel
source: Automatic Water Level (DL Model)
hi: स्वचालित जल स्तर (DL मॉडल)
ta: தானியங்கி நீர்மட்டம் (DL மாடல்)

# manualWaterLevel
source: Manual Water Level Entry
hi: मैन्युअल जल स्तर प्रविष्टि
ta: கைமுறையில் நீர்மட்டம் உள்ளிடுதல்

source: Processing image...
hi: छवि संसाधित हो रही है...
ta: படம் செயலாக்கப்படுகிறது...

# awaitingDl
source: Awaiting DL Model result...
hi: DL मॉडल परिणाम की प्रतीक्षा...
ta: DL மாடல் முடிவுக்காக காத்திருக்கிறது...
